Repository: eliottwantz/Recipes
Catalog: Localizable.xcstrings
Source language: en
Languages: fr

source: %lld ingredients
fr: %lld ingrédients

source: Add
fr: Ajouter

source: Add a new recipe to start building your collection.
fr: Ajoutez une nouvelle recette pour commencer à constituer votre collection.

source: Add a note
fr: Ajouter une note

source: Add a recipe
fr: Ajouter une recette

source: Add Ingredient
fr: Ajouter un ingrédient

source: Add Instruction
fr: Ajouter une instruction

source: Add manually
fr: Ajouter manuellement

source: Add nutritional facts
fr: Ajouter des informations nutritionnelles

source: Add Photos
fr: Ajouter des photos

source: AI model unavailable: %@
fr: Apple Intelligence pas activé: %@

source: All recipes
fr: Toutes les recettes

source: API key configured
fr: Clé d’API configurée

source: API key not configured
fr: Clé d’API non configurée

source: Ask ChatGPT
fr: Demander ChatGPT

source: Cancel
fr: Annuler

source: Cancel the timer
fr: Annuler la minuterie

source: ChatGPT will search online for recipes using your ingredients
fr: ChatGPT recherchera en ligne des recettes utilisant vos ingrédients

source: Checking speech recognition availability...
fr: Vérification de la disponibilité de la reconnaissance vocale...

source: Choose from library
fr: Choisissez dans la photothèque

source: Clear
fr: Effacer

source: Clear all
fr: Tout effacer

source: Clipboard
fr: Presse-papiers

source: Completed
fr: Complété

source: Confirm
fr: Confirmer

source: Cook
fr: Cuisson

source: Cooking Timer
fr: Minuterie de cuisson

source: Copy
fr: Copier

source: Copy Prompt
fr: Copier le prompt

source: Could not extract recipe information from the text.
fr: Impossible d'extraire les informations sur la recette du texte.

source: Could not read image
fr: Impossible de lire l'image

source: Date added
fr: Date d'ajout

source: Default
fr: Par défaut

source: Delete
fr: Supprimer

source: Delete %@. This action cannot be undone.
fr: Supprimer %@. Cette action ne peut pas être annulée.

source: Delete recipe
fr: Supprimer la recette

source: Details
fr: Détails

source: Disabled
fr: Désactivé

source: Dismiss keyboard
fr: Cacher le clavier

source: Done
fr: Fini

source: Downloading speech model: %lld%%
fr: Téléchargement du modèle vocal : ￼%lld%%

source: Edit recipe
fr: Modifier la recette

source: Edit Recipe
fr: Modifier la recette

source: Enabled
fr: Activé

source: Enter API Key
fr: Entrez la clé d’API

source: Extracted text added to notes
fr: Texte extrait ajouté aux notes

source: Extracting recipe from web page...
fr: Extraction de la recette à partir de la page web

source: Extracting text from image
fr: Extraction du texte dans l’image

source: Extraction Failed
fr: Échec de l'extraction

source: Failed to load image
fr: Échec du chargement de l'image

source: Failed to parse recipe: %@
fr: Échec de l'analyse de la recette : ￼%@

source: Failed to process the image.
fr: Échec du traitement de l'image.

source: Failed to read text from image: %@
fr: Échec de la lecture du texte dans l'image : ￼%@

source: Find by ingredients
fr: Rechercher par ingrédients

source: Find Recipes
fr: Trouver des recettes

source: Find recipes with ChatGPT
fr: Trouvez des recettes avec ChatGPT

source: From Camera...
fr: De l’appareil photo

source: From Image...
fr: D’une image

source: From Social Media...
fr: Des réseaux sociaux...

source: Go to Settings to add your API key.
fr: Accédez aux réglages pour ajouter votre clé d’API.

source: Hands Free
fr: Mains libres

source: Hour
fr: Heure

source: Identifying ingredients and instructions
fr: Identification des ingrédients et des instructions

source: Import
fr: Importer

source: Import failed
fr: Échec de l'importation

source: Import from Photo
fr: Importation à partir d’une photo

source: Import from Social Media
fr: Importer depuis les réseaux sociaux

source: Ingredient
fr: Ingrédient

source: Ingredients
fr: Ingrédients

source: Language
fr: Langue

source: Language of the video content
fr: Langue du contenu vidéo

source: Listening... Tap to stop
fr: Écoute... Appuyez pour arrêter

source: Microphone permission denied
fr: Autorisation du microphone refusée

source: More
fr: Plus

source: Name
fr: Nom

source: No Recipes Yet
fr: Aucune recette pour l'instant

source: No text found in the image.
fr: Aucun texte trouvé dans l'image.

source: No text found in the photo
fr: Aucun texte trouvé dans l'image

source: Not completed
fr: Non terminé

source: Open App
fr: Ouvrir l’application

source: Opens the app
fr: Ouvre l'application

source: Original Website
fr: Site web d’origine

source: Parsing incomplete
fr: Analyse incomplète

source: Parsing recipe...
fr: Analyse de la recette

source: Paste in ChatGPT or any AI assistant
fr: Collez dans ChatGPT ou n'importe quel assistant IA

source: Paste video URL
fr: Coller l'URL de la vidéo

source: Prep
fr: Preparation

source: Processing...
fr: Traitement...

source: Prompt copied
fr: Prompt copiée

source: Reading photo...
fr: Lecture de l'image

source: Recipe Language
fr: Langue de la recette

source: Recipes
fr: Recettes

source: Required to import recipes from YouTube, Instagram, or TikTok videos.
fr: Nécessaire pour importer des recettes à partir de vidéos YouTube, Instagram ou TikTok.

source: Save API Key
fr: Enregistrer la clé d’API

source: Scale
fr: Modifier la quantité

source: Scale amount
fr: Coefficient

source: Scale Mode
fr: Mode d’augmentation

source: Scale: x %@
fr: Quantité: x %@

# ScalingMode.amount
source: Amount
fr: Quantité

# ScalingMode.ingredient
source: Ingredient
fr: Ingrédient

# ScalingMode.serving
source: Serving
fr: Portion

source: Select Delete to permanently remove %@.
fr: Sélectionnez Supprimer pour supprimer définitivement %@.

source: Select Delete to permanently remove %lld recipes.
fr: Sélectionnez Supprimer pour supprimer définitivement %lld recettes.

source: Select recipes
fr: Sélectionner des recettes

source: Settings
fr: Réglages

source: Smart Import
fr: Importation intelligente

source: Social Media Import
fr: Importation de réseaux sociaux

source: Sorting
fr: Trier

source: Start
fr: Commencer

source: Start cooking
fr: Commencer à cuisiner

source: Start timer
fr: Commencer la minuterie

source: Step %lld
fr: Étape %lld

source: Supports YouTube, Instagram Reels, and TikTok videos
fr: Prend en charge les vidéos YouTube, Instagram Reels et TikTok

source: Take Photo
fr: Prendre une photo

source: Tap the microphone to speak your ingredients, or type them here...
fr: Appuyez sur le microphone pour dicter vos ingrédients, ou saisissez-les ici...

source: Tap the microphone to start speaking
fr: Appuyez sur le microphone pour commencer à parler

source: Text recognition failed: %@
fr: La reconnaissance de texte a échoué: ￼%@

source: The recipe image
fr: L’image de la recette

source: Timer ended
fr: Minuterie terminée

source: Update
fr: Mettre à jour

source: Video URL
fr: URL de la vidéo

source: Voice input error. Please type your ingredients.
fr: Erreur de saisie vocale. Veuillez saisir vos ingrédients manuellement.

source: Voice input unavailable. Please type your ingredients.
fr: Saisie vocale indisponible. Veuillez saisir vos ingrédients manuellement.

source: Website
fr: Site web

source: Website URL
fr: L’url du site web

source: What ingredients do you have?
fr: Quels ingrédients avez-vous ?
